[Killed] BlockStatement
Chapter04/my-first-suite-test-project/src/Queue.ts:4:44
 export class Queue<T> {
     private _store: T[] = [];
 
-    constructor(initialData: Array<T> = []){
-        this._store.push(...initialData);
-    }
+    constructor(initialData: Array<T> = []){}
 
     push(val: T){

[Killed] BlockStatement
Chapter04/my-first-suite-test-project/src/Queue.ts:8:17
         this._store.push(...initialData);
     }
 
-    push(val: T){
-        this._store.push(val);
-    }
+    push(val: T){}
 
     pop(): T | undefined {

[Killed] EqualityOperator
Chapter04/my-first-suite-test-project/src/Queue.ts:17:28
     }
 
     isEmpty(): boolean {
-        return this.size() === 0;
+        return this.size() !== 0;
     }
 

[Killed] ConditionalExpression
Chapter04/my-first-suite-test-project/src/Queue.ts:17:16
     }
 
     isEmpty(): boolean {
-        return this.size() === 0;
+        return false;
     }
 
