[Killed] Block
Chapter06/order-api/src/app.ts:16:18
     public apiRoutes: APIRoute = new APIRoute();
     public orderRoutes: OrderRoute = new OrderRoute();
 
-    constructor(){
-        this.app = express();
-        this.app.use(bodyParser.json());
-        this.indexRoutes.routes(this.app);
-        this.userRoutes.routes(this.app);
-        this.apiRoutes.routes(this.app);
-        this.orderRoutes.routes(this.app);
-    }
+    constructor(){}
 }
 
