[Timeout] Block
order-api/src/controllers/api.ts:3:75
 import { NextFunction, Request, Response } from 'express'
 
-export let getApi = (req: Request, res: Response, next: NextFunction ) => {
-    return res.status(200).send({title: 'Order API'})
-}
+export let getApi = (req: Request, res: Response, next: NextFunction ) => {}

[Survived] StringLiteral
order-api/src/controllers/api.ts:4:41
 import { NextFunction, Request, Response } from 'express'
 
 export let getApi = (req: Request, res: Response, next: NextFunction ) => {
-    return res.status(200).send({title: 'Order API'})
+    return res.status(200).send({title: ""})
 }
