[Timeout] Block
order-api/src/controllers/order.ts:8:76
 
 let orders: Array<Order> = []
 
-export let getOrder = (req: Request, res: Response, next: NextFunction) => {
-  const id = req.params.id
-  const order = orders.find(obj => obj.id === Number(id))
-  const httpStatusCode = order ? 200 : 404
-  return res.status(httpStatusCode).send(order)
-}
+export let getOrder = (req: Request, res: Response, next: NextFunction) => {}
 
 export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {

[Timeout] BinaryExpression
order-api/src/controllers/order.ts:10:43
 
 export let getOrder = (req: Request, res: Response, next: NextFunction) => {
   const id = req.params.id
-  const order = orders.find(obj => obj.id === Number(id))
+  const order = orders.find(obj => obj.id !== Number(id))
   const httpStatusCode = order ? 200 : 404
   return res.status(httpStatusCode).send(order)

[Timeout] ConditionalExpression
order-api/src/controllers/order.ts:10:36
 
 export let getOrder = (req: Request, res: Response, next: NextFunction) => {
   const id = req.params.id
-  const order = orders.find(obj => obj.id === Number(id))
+  const order = orders.find(obj => false)
   const httpStatusCode = order ? 200 : 404
   return res.status(httpStatusCode).send(order)

[Timeout] Block
order-api/src/controllers/order.ts:15:80
   return res.status(httpStatusCode).send(order)
 }
 
-export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {
-  const limit = req.query.limit || orders.length
-  const offset = req.query.offset || 0
-  return res.status(200).send(
-    _(orders)
-      .drop(offset)
-      .take(limit)
-      .value()
-  )
-}
+export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {}
 
 export let addOrder = (req: Request, res: Response, next: NextFunction) => {

[Survived] BinaryExpression
order-api/src/controllers/order.ts:16:33
 }
 
 export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {
-  const limit = req.query.limit || orders.length
+  const limit = req.query.limit && orders.length
   const offset = req.query.offset || 0
   return res.status(200).send(

[Timeout] ConditionalExpression
order-api/src/controllers/order.ts:16:17
 }
 
 export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {
-  const limit = req.query.limit || orders.length
+  const limit = false
   const offset = req.query.offset || 0
   return res.status(200).send(

[Timeout] ConditionalExpression
order-api/src/controllers/order.ts:17:18
 
 export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {
   const limit = req.query.limit || orders.length
-  const offset = req.query.offset || 0
+  const offset = false
   return res.status(200).send(
     _(orders)

[Survived] ConditionalExpression
order-api/src/controllers/order.ts:17:18
 
 export let getAllOrders = (req: Request, res: Response, next: NextFunction) => {
   const limit = req.query.limit || orders.length
-  const offset = req.query.offset || 0
+  const offset = true
   return res.status(200).send(
     _(orders)

[Timeout] Block
order-api/src/controllers/order.ts:26:76
   )
 }
 
-export let addOrder = (req: Request, res: Response, next: NextFunction) => {
-  const order: Order = {
-    // generic random value from 1 to 100 only for tests so far
-    id: Math.floor(Math.random() * 100) + 1,
-    userId: req.body.userId,
-    quantity: req.body.quantity,
-    shipDate: req.body.shipDate,
-    status: OrderStatus.Placed,
-    complete: false,
-  }
-  orders.push(order)
-  return res.status(201).send(order)
-}
+export let addOrder = (req: Request, res: Response, next: NextFunction) => {}
 
 export let removeOrder = (req: Request, res: Response, next: NextFunction) => {

[Survived] BinaryExpression
order-api/src/controllers/order.ts:29:41
 export let addOrder = (req: Request, res: Response, next: NextFunction) => {
   const order: Order = {
     // generic random value from 1 to 100 only for tests so far
-    id: Math.floor(Math.random() * 100) + 1,
+    id: Math.floor(Math.random() * 100) - 1,
     userId: req.body.userId,
     quantity: req.body.quantity,

[Survived] BinaryExpression
order-api/src/controllers/order.ts:29:34
 export let addOrder = (req: Request, res: Response, next: NextFunction) => {
   const order: Order = {
     // generic random value from 1 to 100 only for tests so far
-    id: Math.floor(Math.random() * 100) + 1,
+    id: Math.floor(Math.random() / 100) + 1,
     userId: req.body.userId,
     quantity: req.body.quantity,

[Killed] BooleanSubstitution
order-api/src/controllers/order.ts:34:15
     quantity: req.body.quantity,
     shipDate: req.body.shipDate,
     status: OrderStatus.Placed,
-    complete: false,
+    complete: true,
   }
   orders.push(order)

[Timeout] Block
order-api/src/controllers/order.ts:40:79
   return res.status(201).send(order)
 }
 
-export let removeOrder = (req: Request, res: Response, next: NextFunction) => {
-  const id = Number(req.params.id)
-  const orderIndex = orders.findIndex(item => item.id === id)
-
-  if (orderIndex === -1) {
-    return res.status(404).send()
-  }
-
-  orders = orders.filter(item => item.id !== id)
-
-  return res.status(204).send()
-}
+export let removeOrder = (req: Request, res: Response, next: NextFunction) => {}
 
 export let getInventory = (req: Request, res: Response, next: NextFunction) => {

[Timeout] ArrowFunction
order-api/src/controllers/order.ts:42:39
 
 export let removeOrder = (req: Request, res: Response, next: NextFunction) => {
   const id = Number(req.params.id)
-  const orderIndex = orders.findIndex(item => item.id === id)
+  const orderIndex = orders.findIndex(() => undefined)
 
   if (orderIndex === -1) {

[Survived] ConditionalExpression
order-api/src/controllers/order.ts:42:47
 
 export let removeOrder = (req: Request, res: Response, next: NextFunction) => {
   const id = Number(req.params.id)
-  const orderIndex = orders.findIndex(item => item.id === id)
+  const orderIndex = orders.findIndex(item => true)
 
   if (orderIndex === -1) {

[Killed] IfStatement
order-api/src/controllers/order.ts:44:7
   const id = Number(req.params.id)
   const orderIndex = orders.findIndex(item => item.id === id)
 
-  if (orderIndex === -1) {
+  if (true) {
     return res.status(404).send()
   }

[Killed] IfStatement
order-api/src/controllers/order.ts:44:7
   const id = Number(req.params.id)
   const orderIndex = orders.findIndex(item => item.id === id)
 
-  if (orderIndex === -1) {
+  if (false) {
     return res.status(404).send()
   }

[Killed] ConditionalExpression
order-api/src/controllers/order.ts:48:3
     return res.status(404).send()
   }
 
-  orders = orders.filter(item => item.id !== id)
+  false
 
   return res.status(204).send()

[Timeout] BinaryExpression
order-api/src/controllers/order.ts:48:42
     return res.status(404).send()
   }
 
-  orders = orders.filter(item => item.id !== id)
+  orders = orders.filter(item => item.id === id)
 
   return res.status(204).send()

[Timeout] Block
order-api/src/controllers/order.ts:53:80
   return res.status(204).send()
 }
 
-export let getInventory = (req: Request, res: Response, next: NextFunction) => {
-  const status = req.query.status
-  let inventoryOrders = orders
-  if (status) {
-    inventoryOrders = inventoryOrders.filter(item => item.status === status)
-  }
-
-  const grouppedOrders = _.groupBy(inventoryOrders, 'userId')
-  return res.status(200).send(grouppedOrders)
-}
+export let getInventory = (req: Request, res: Response, next: NextFunction) => {}
 

[Timeout] IfStatement
order-api/src/controllers/order.ts:56:7
 export let getInventory = (req: Request, res: Response, next: NextFunction) => {
   const status = req.query.status
   let inventoryOrders = orders
-  if (status) {
+  if (false) {
     inventoryOrders = inventoryOrders.filter(item => item.status === status)
   }

[Timeout] IfStatement
order-api/src/controllers/order.ts:56:7
 export let getInventory = (req: Request, res: Response, next: NextFunction) => {
   const status = req.query.status
   let inventoryOrders = orders
-  if (status) {
+  if (true) {
     inventoryOrders = inventoryOrders.filter(item => item.status === status)
   }

[Timeout] ConditionalExpression
order-api/src/controllers/order.ts:57:5
   const status = req.query.status
   let inventoryOrders = orders
   if (status) {
-    inventoryOrders = inventoryOrders.filter(item => item.status === status)
+    false
   }
 

[Timeout] ArrowFunction
order-api/src/controllers/order.ts:57:46
   const status = req.query.status
   let inventoryOrders = orders
   if (status) {
-    inventoryOrders = inventoryOrders.filter(item => item.status === status)
+    inventoryOrders = inventoryOrders.filter(() => undefined)
   }
 

[Killed] StringLiteral
order-api/src/controllers/order.ts:60:53
     inventoryOrders = inventoryOrders.filter(item => item.status === status)
   }
 
-  const grouppedOrders = _.groupBy(inventoryOrders, 'userId')
+  const grouppedOrders = _.groupBy(inventoryOrders, "")
   return res.status(200).send(grouppedOrders)
 }
