[Timeout] Block
order-api/src/controllers/user.ts:6:75
 
 let users: Array<User> = []
 
-export let getUser = (req: Request, res: Response, next: NextFunction) => {
-    const username = req.params.username
-    const user = users.find(obj => obj.username === username)
-    const httpStatusCode = user ? 200 : 404
-    return res.status(httpStatusCode).send(user)
-}
+export let getUser = (req: Request, res: Response, next: NextFunction) => {}
 
 export let addUser = (req: Request, res: Response, next: NextFunction) => {

[Killed] BinaryExpression
order-api/src/controllers/user.ts:8:49
 
 export let getUser = (req: Request, res: Response, next: NextFunction) => {
     const username = req.params.username
-    const user = users.find(obj => obj.username === username)
+    const user = users.find(obj => obj.username !== username)
     const httpStatusCode = user ? 200 : 404
     return res.status(httpStatusCode).send(user)

[Timeout] ArrowFunction
order-api/src/controllers/user.ts:8:29
 
 export let getUser = (req: Request, res: Response, next: NextFunction) => {
     const username = req.params.username
-    const user = users.find(obj => obj.username === username)
+    const user = users.find(() => undefined)
     const httpStatusCode = user ? 200 : 404
     return res.status(httpStatusCode).send(user)

[Timeout] Block
order-api/src/controllers/user.ts:13:75
     return res.status(httpStatusCode).send(user)
 }
 
-export let addUser = (req: Request, res: Response, next: NextFunction) => {
-    const user: User = {
-        // generic random value from 1 to 100 only for test so far
-        id: Math.floor(Math.random() * 100) + 1,
-        username: req.body.username,
-        firstName: req.body.firstName,
-        lastName: req.body.lastName,
-        email: req.body.email,
-        password: req.body.password,
-        phone: req.body.phone,
-        userStatus: 1
-    }
-    users.push(user)
-    return res.status(201).send(user)
-}
+export let addUser = (req: Request, res: Response, next: NextFunction) => {}
 
 export let updateUser = (req: Request, res: Response, next: NextFunction) => {

[Timeout] BinaryExpression
order-api/src/controllers/user.ts:16:45
 export let addUser = (req: Request, res: Response, next: NextFunction) => {
     const user: User = {
         // generic random value from 1 to 100 only for test so far
-        id: Math.floor(Math.random() * 100) + 1,
+        id: Math.floor(Math.random() * 100) - 1,
         username: req.body.username,
         firstName: req.body.firstName,

[Timeout] BinaryExpression
order-api/src/controllers/user.ts:16:38
 export let addUser = (req: Request, res: Response, next: NextFunction) => {
     const user: User = {
         // generic random value from 1 to 100 only for test so far
-        id: Math.floor(Math.random() * 100) + 1,
+        id: Math.floor(Math.random() / 100) + 1,
         username: req.body.username,
         firstName: req.body.firstName,

[Timeout] Block
order-api/src/controllers/user.ts:29:78
     return res.status(201).send(user)
 }
 
-export let updateUser = (req: Request, res: Response, next: NextFunction) => {
-  const username = req.params.username
-  const userIndex = users.findIndex(item => item.username === username)
-
-  if (userIndex === -1) {
-    return res.status(404).send()
-  }
-
-  const user = users[userIndex]
-  user.username = req.body.username || user.username
-  user.firstName = req.body.firstName || user.firstName
-  user.lastName = req.body.lastName || user.lastName
-  user.email = req.body.email || user.email
-  user.password = req.body.password || user.password
-  user.phone = req.body.phone || user.phone
-  user.userStatus = req.body.userStatus || user.userStatus
-
-  users[userIndex] = user
-  return res.status(204).send()
-}
+export let updateUser = (req: Request, res: Response, next: NextFunction) => {}
 
 export let removeUser = (req: Request, res: Response, next: NextFunction) => {

[Killed] ConditionalExpression
order-api/src/controllers/user.ts:31:45
 
 export let updateUser = (req: Request, res: Response, next: NextFunction) => {
   const username = req.params.username
-  const userIndex = users.findIndex(item => item.username === username)
+  const userIndex = users.findIndex(item => true)
 
   if (userIndex === -1) {

[Killed] BinaryExpression
order-api/src/controllers/user.ts:31:59
 
 export let updateUser = (req: Request, res: Response, next: NextFunction) => {
   const username = req.params.username
-  const userIndex = users.findIndex(item => item.username === username)
+  const userIndex = users.findIndex(item => item.username !== username)
 
   if (userIndex === -1) {

[Killed] BinaryExpression
order-api/src/controllers/user.ts:33:17
   const username = req.params.username
   const userIndex = users.findIndex(item => item.username === username)
 
-  if (userIndex === -1) {
+  if (userIndex !== -1) {
     return res.status(404).send()
   }

[Killed] IfStatement
order-api/src/controllers/user.ts:33:7
   const username = req.params.username
   const userIndex = users.findIndex(item => item.username === username)
 
-  if (userIndex === -1) {
+  if (true) {
     return res.status(404).send()
   }

[Timeout] BinaryExpression
order-api/src/controllers/user.ts:38:37
   }
 
   const user = users[userIndex]
-  user.username = req.body.username || user.username
+  user.username = req.body.username && user.username
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:38:3
   }
 
   const user = users[userIndex]
-  user.username = req.body.username || user.username
+  false
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:39:3
 
   const user = users[userIndex]
   user.username = req.body.username || user.username
-  user.firstName = req.body.firstName || user.firstName
+  false
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:39:3
 
   const user = users[userIndex]
   user.username = req.body.username || user.username
-  user.firstName = req.body.firstName || user.firstName
+  true
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email

[Survived] BinaryExpression
order-api/src/controllers/user.ts:40:37
   const user = users[userIndex]
   user.username = req.body.username || user.username
   user.firstName = req.body.firstName || user.firstName
-  user.lastName = req.body.lastName || user.lastName
+  user.lastName = req.body.lastName && user.lastName
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password

[Survived] ConditionalExpression
order-api/src/controllers/user.ts:40:3
   const user = users[userIndex]
   user.username = req.body.username || user.username
   user.firstName = req.body.firstName || user.firstName
-  user.lastName = req.body.lastName || user.lastName
+  false
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:41:16
   user.username = req.body.username || user.username
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
-  user.email = req.body.email || user.email
+  user.email = true
   user.password = req.body.password || user.password
   user.phone = req.body.phone || user.phone

[Survived] BinaryExpression
order-api/src/controllers/user.ts:41:31
   user.username = req.body.username || user.username
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
-  user.email = req.body.email || user.email
+  user.email = req.body.email && user.email
   user.password = req.body.password || user.password
   user.phone = req.body.phone || user.phone

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:42:19
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
-  user.password = req.body.password || user.password
+  user.password = false
   user.phone = req.body.phone || user.phone
   user.userStatus = req.body.userStatus || user.userStatus

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:42:3
   user.firstName = req.body.firstName || user.firstName
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
-  user.password = req.body.password || user.password
+  false
   user.phone = req.body.phone || user.phone
   user.userStatus = req.body.userStatus || user.userStatus

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:43:3
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
-  user.phone = req.body.phone || user.phone
+  true
   user.userStatus = req.body.userStatus || user.userStatus
 

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:43:3
   user.lastName = req.body.lastName || user.lastName
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
-  user.phone = req.body.phone || user.phone
+  false
   user.userStatus = req.body.userStatus || user.userStatus
 

[Timeout] BinaryExpression
order-api/src/controllers/user.ts:44:41
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
   user.phone = req.body.phone || user.phone
-  user.userStatus = req.body.userStatus || user.userStatus
+  user.userStatus = req.body.userStatus && user.userStatus
 
   users[userIndex] = user

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:44:3
   user.email = req.body.email || user.email
   user.password = req.body.password || user.password
   user.phone = req.body.phone || user.phone
-  user.userStatus = req.body.userStatus || user.userStatus
+  true
 
   users[userIndex] = user

[Survived] ConditionalExpression
order-api/src/controllers/user.ts:46:3
   user.phone = req.body.phone || user.phone
   user.userStatus = req.body.userStatus || user.userStatus
 
-  users[userIndex] = user
+  false
   return res.status(204).send()
 }

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:46:3
   user.phone = req.body.phone || user.phone
   user.userStatus = req.body.userStatus || user.userStatus
 
-  users[userIndex] = user
+  true
   return res.status(204).send()
 }

[Timeout] Block
order-api/src/controllers/user.ts:50:78
   return res.status(204).send()
 }
 
-export let removeUser = (req: Request, res: Response, next: NextFunction) => {
-  const username = req.params.username
-  const userIndex = users.findIndex(item => item.username === username)
-
-  if (userIndex === -1) {
-    return res.status(404).send()
-  }
-
-  users = users.filter(item => item.username !== username)
-
-  return res.status(204).send()
-}
+export let removeUser = (req: Request, res: Response, next: NextFunction) => {}
 

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:52:45
 
 export let removeUser = (req: Request, res: Response, next: NextFunction) => {
   const username = req.params.username
-  const userIndex = users.findIndex(item => item.username === username)
+  const userIndex = users.findIndex(item => false)
 
   if (userIndex === -1) {

[Timeout] PrefixUnaryExpression
order-api/src/controllers/user.ts:54:21
   const username = req.params.username
   const userIndex = users.findIndex(item => item.username === username)
 
-  if (userIndex === -1) {
+  if (userIndex === +1) {
     return res.status(404).send()
   }

[Timeout] IfStatement
order-api/src/controllers/user.ts:54:7
   const username = req.params.username
   const userIndex = users.findIndex(item => item.username === username)
 
-  if (userIndex === -1) {
+  if (false) {
     return res.status(404).send()
   }

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:58:3
     return res.status(404).send()
   }
 
-  users = users.filter(item => item.username !== username)
+  true
 
   return res.status(204).send()

[Timeout] ConditionalExpression
order-api/src/controllers/user.ts:58:32
     return res.status(404).send()
   }
 
-  users = users.filter(item => item.username !== username)
+  users = users.filter(item => false)
 
   return res.status(204).send()
