[Timeout] StringLiteral
order-api/src/model/orderStatus.ts:4:14
 'use strict'
 
 export enum OrderStatus {
-    Placed = 'PLACED',
+    Placed = "",
     Approved = 'APPROVED',
     Delivered = 'DELIVERED'

[Timeout] StringLiteral
order-api/src/model/orderStatus.ts:5:16
 
 export enum OrderStatus {
     Placed = 'PLACED',
-    Approved = 'APPROVED',
+    Approved = "",
     Delivered = 'DELIVERED'
 }
