[Timeout] Block
order-api/src/routes/index.ts:4:29
 import { Request, Response } from 'express'
 
 export class Index {
-    public routes(app):void {
-        app.route('/index').get((req: Request, res: Response) => {
-            res.status(200).send({ status: 'success'})
-        })
-    }
+    public routes(app):void {}
 }

[Timeout] Block
order-api/src/routes/index.ts:5:66
 
 export class Index {
     public routes(app):void {
-        app.route('/index').get((req: Request, res: Response) => {
-            res.status(200).send({ status: 'success'})
-        })
+        app.route('/index').get((req: Request, res: Response) => {})
     }
 }

[Timeout] StringLiteral
order-api/src/routes/index.ts:6:44
 export class Index {
     public routes(app):void {
         app.route('/index').get((req: Request, res: Response) => {
-            res.status(200).send({ status: 'success'})
+            res.status(200).send({ status: ""})
         })
     }
