[Timeout] Block
order-api/src/routes/order.ts:4:30
 import * as orderController from '../controllers/order'
 
 export class OrderRoute {
-    public routes(app): void {
-        app.route('/store/inventory').get(orderController.getInventory)
-        app.route('/store/orders').post(orderController.addOrder)
-        app.route('/store/orders/:id').get(orderController.getOrder)
-        app.route('/store/orders/:id').delete(orderController.removeOrder)
-    }
+    public routes(app): void {}
 }

[Timeout] StringLiteral
order-api/src/routes/order.ts:5:19
 
 export class OrderRoute {
     public routes(app): void {
-        app.route('/store/inventory').get(orderController.getInventory)
+        app.route("").get(orderController.getInventory)
         app.route('/store/orders').post(orderController.addOrder)
         app.route('/store/orders/:id').get(orderController.getOrder)
