[Timeout] Block
order-api/src/routes/api.ts:4:30
 import * as apiController from '../controllers/api'
 
 export class APIRoute {
-    public routes(app): void {
-        app.route('/api').get(apiController.getApi)
-    }
+    public routes(app): void {}
 }
